events/app/controllers/events_controller.rb

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        @event = Event.find(params[:id])

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def edit
        @event = Event.find(params[:id])

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "events" SET "capacity" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["capacity", 1], ["updated_at", "2019-01-28 23:37:43.518373"], ["id", 1]]
---
    def update
        @event = Event.find(params[:id])
        @event.update(event_params)

INSERT INTO "events" ("name", "location", "price", "created_at", "updated_at", "starts_at", "description", "image_file_name", "capacity") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        @event = Event.new(event_params)
        if @event.save