events/app/controllers/registrations_controller.rb

    def create
        @registration = @event.registrations.new(registration_params)
        if @registration.save
---
INSERT INTO "registrations" ("name", "email", "how_heard", "event_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Tavo"], ["email", "tsoto111@gmail.com"], ["how_heard", "Friend/Coworker"], ["event_id", 1], ["created_at", "2019-01-28 21:18:24.399810"], ["updated_at", "2019-01-28 21:18:24.399810"]]

    def set_up
        @event = Event.find(params[:event_id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]